# Final-Task

# Итоговое задание по курсу разработчик! 

## Задание :
1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

## Задача на языке С# 
Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []

## Решение

```
Console.Clear();

string[] array = new string[] { "1234", "156", "-2", "computer science", "-2","Kazan", "2",":-)" };
//Создаем массив (строковый)

void PrintArray(string[] arr) //Функция печати массива/и перебирает весь массив 
{
    for (int i = 0; i < arr.Length; i++)
    {
        Console.Write($"{arr[i]} ");
    }
    Console.WriteLine();
}


void Formation(string[] arr) // функция с условием/ если object.Length <= 3 (объект меньше или равен 3) Если есть объект то тогда создается новый массив такого же типа и в ячейку нового массива записывается значение ячейки первичного массива
{
    for (int i = 0; i < arr.Length; i++)
    {
        string @object = arr[i];
        if (@object.Length <= 3)
        {
            arr[i] = @object;
    }
        else arr[i] = string.Empty;
    }
}

PrintArray(array);
Formation(array);
Console.Write("Новый массив из строк, длина которых меньше, либо равна 3 символам: ");
PrintArray(array);

```